digital-systems/layout.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-23 Thu 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Digital Systems Course Layout</title>
<meta name="author" content="Ido Merenstein" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../org-html/style.css" />
<link rel="alternate stylesheet" type="text/css" href="../org-html/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Digital Systems Course Layout</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org68080c7">1. אלגברת מיתוג</a>
<ul>
<li><a href="#org1d52933">1.1. זהויות מיתוג בסיסיות</a></li>
<li><a href="#org90d6b34">1.2. חוקי דה-מורגן</a></li>
</ul>
</li>
<li><a href="#org3b69acd">2. פונקציות מיתוג</a>
<ul>
<li><a href="#org6cac751">2.1. צורות קנוניות</a></li>
<li><a href="#orga580e43">2.2. פונקציית XOR</a></li>
<li><a href="#org9ad9424">2.3. מערכת פעולות שלמה</a></li>
</ul>
</li>
<li><a href="#orgb489282">3. מינימיזציה של פונקציות מיתוג</a>
<ul>
<li><a href="#orga31388b">3.1. מפת קרנו</a></li>
</ul>
</li>
<li><a href="#org2447806">4. פונקציות מינימליות ותכונותיהן</a>
<ul>
<li><a href="#org159d847">4.1. הגדרות וטענות בסיביות</a></li>
<li><a href="#org5fc5890">4.2. תהליך קבלת ביטוי מינימלי לפונקציה</a></li>
<li><a href="#orgac35c09">4.3. צירופי ברירה</a></li>
</ul>
</li>
<li><a href="#org19e2564">5. מודל ספרתי ושערים לוגיים</a>
<ul>
<li><a href="#org6100ba8">5.1. הגדרות</a></li>
<li><a href="#orgc5c1cbd">5.2. ההפשטה הספרתית</a></li>
<li><a href="#org685de9d">5.3. הגדרות זמני השהייה</a></li>
<li><a href="#org2f432fd">5.4. הבהובים סטטיים ודינמיים</a></li>
</ul>
</li>
<li><a href="#org46c4b00">6. מסכמים, בוררים, מפענחים</a>
<ul>
<li><a href="#org24eeb89">6.1. מסכם בינארי מלא</a></li>
<li><a href="#org4f5ef2f">6.2. בורר</a></li>
<li><a href="#org3648ea3">6.3. מפענח</a></li>
</ul>
</li>
<li><a href="#org0aa86a7">7. מבנים רגולריים</a>
<ul>
<li><a href="#org4d9f1a2">7.1. בניית שערים לוגיים באמצעות מתגים</a></li>
<li><a href="#orgaeb1cb4">7.2. Three (Tri)-State Bus</a></li>
<li><a href="#org79ab5cd">7.3. Wired-AND (pull-down) Bus</a></li>
<li><a href="#org31c64d2">7.4. Wired-OR (pull-up) Bus</a></li>
<li><a href="#org13587c1">7.5. Programmable Logic Array (PLA)</a></li>
<li><a href="#org7684255">7.6. Read Only Memory (ROM)</a></li>
<li><a href="#org093a279">7.7. RAM (dual port: read, write)</a></li>
<li><a href="#orga24635d">7.8. גילוי תקלות בזיכרונות</a></li>
</ul>
</li>
<li><a href="#org88bc2a1">8. יחידות זכרון</a></li>
</ul>
</div>
</div>

<div id="outline-container-org68080c7" class="outline-2">
<h2 id="org68080c7"><span class="section-number-2">1.</span> אלגברת מיתוג</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1d52933" class="outline-3">
<h3 id="org1d52933"><span class="section-number-3">1.1.</span> זהויות מיתוג בסיסיות</h3>
</div>
<div id="outline-container-org90d6b34" class="outline-3">
<h3 id="org90d6b34"><span class="section-number-3">1.2.</span> חוקי דה-מורגן</h3>
</div>
</div>

<div id="outline-container-org3b69acd" class="outline-2">
<h2 id="org3b69acd"><span class="section-number-2">2.</span> פונקציות מיתוג</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6cac751" class="outline-3">
<h3 id="org6cac751"><span class="section-number-3">2.1.</span> צורות קנוניות</h3>
</div>
<div id="outline-container-orga580e43" class="outline-3">
<h3 id="orga580e43"><span class="section-number-3">2.2.</span> פונקציית XOR</h3>
</div>
<div id="outline-container-org9ad9424" class="outline-3">
<h3 id="org9ad9424"><span class="section-number-3">2.3.</span> מערכת פעולות שלמה</h3>
</div>
</div>

<div id="outline-container-orgb489282" class="outline-2">
<h2 id="orgb489282"><span class="section-number-2">3.</span> מינימיזציה של פונקציות מיתוג</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga31388b" class="outline-3">
<h3 id="orga31388b"><span class="section-number-3">3.1.</span> מפת קרנו</h3>
</div>
</div>

<div id="outline-container-org2447806" class="outline-2">
<h2 id="org2447806"><span class="section-number-2">4.</span> פונקציות מינימליות ותכונותיהן</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org159d847" class="outline-3">
<h3 id="org159d847"><span class="section-number-3">4.1.</span> הגדרות וטענות בסיביות</h3>
</div>
<div id="outline-container-org5fc5890" class="outline-3">
<h3 id="org5fc5890"><span class="section-number-3">4.2.</span> תהליך קבלת ביטוי מינימלי לפונקציה</h3>
</div>
<div id="outline-container-orgac35c09" class="outline-3">
<h3 id="orgac35c09"><span class="section-number-3">4.3.</span> צירופי ברירה</h3>
</div>
</div>

<div id="outline-container-org19e2564" class="outline-2">
<h2 id="org19e2564"><span class="section-number-2">5.</span> מודל ספרתי ושערים לוגיים</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6100ba8" class="outline-3">
<h3 id="org6100ba8"><span class="section-number-3">5.1.</span> הגדרות</h3>
</div>
<div id="outline-container-orgc5c1cbd" class="outline-3">
<h3 id="orgc5c1cbd"><span class="section-number-3">5.2.</span> ההפשטה הספרתית</h3>
</div>
<div id="outline-container-org685de9d" class="outline-3">
<h3 id="org685de9d"><span class="section-number-3">5.3.</span> הגדרות זמני השהייה</h3>
</div>
<div id="outline-container-org2f432fd" class="outline-3">
<h3 id="org2f432fd"><span class="section-number-3">5.4.</span> הבהובים סטטיים ודינמיים</h3>
</div>
</div>

<div id="outline-container-org46c4b00" class="outline-2">
<h2 id="org46c4b00"><span class="section-number-2">6.</span> מסכמים, בוררים, מפענחים</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org24eeb89" class="outline-3">
<h3 id="org24eeb89"><span class="section-number-3">6.1.</span> מסכם בינארי מלא</h3>
</div>
<div id="outline-container-org4f5ef2f" class="outline-3">
<h3 id="org4f5ef2f"><span class="section-number-3">6.2.</span> בורר</h3>
</div>
<div id="outline-container-org3648ea3" class="outline-3">
<h3 id="org3648ea3"><span class="section-number-3">6.3.</span> מפענח</h3>
</div>
</div>


<div id="outline-container-org0aa86a7" class="outline-2">
<h2 id="org0aa86a7"><span class="section-number-2">7.</span> מבנים רגולריים</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4d9f1a2" class="outline-3">
<h3 id="org4d9f1a2"><span class="section-number-3">7.1.</span> בניית שערים לוגיים באמצעות מתגים</h3>
</div>
<div id="outline-container-orgaeb1cb4" class="outline-3">
<h3 id="orgaeb1cb4"><span class="section-number-3">7.2.</span> Three (Tri)-State Bus</h3>
</div>
<div id="outline-container-org79ab5cd" class="outline-3">
<h3 id="org79ab5cd"><span class="section-number-3">7.3.</span> Wired-AND (pull-down) Bus</h3>
</div>
<div id="outline-container-org31c64d2" class="outline-3">
<h3 id="org31c64d2"><span class="section-number-3">7.4.</span> Wired-OR (pull-up) Bus</h3>
</div>
<div id="outline-container-org13587c1" class="outline-3">
<h3 id="org13587c1"><span class="section-number-3">7.5.</span> Programmable Logic Array (PLA)</h3>
</div>
<div id="outline-container-org7684255" class="outline-3">
<h3 id="org7684255"><span class="section-number-3">7.6.</span> Read Only Memory (ROM)</h3>
</div>
<div id="outline-container-org093a279" class="outline-3">
<h3 id="org093a279"><span class="section-number-3">7.7.</span> RAM (dual port: read, write)</h3>
</div>
<div id="outline-container-orga24635d" class="outline-3">
<h3 id="orga24635d"><span class="section-number-3">7.8.</span> גילוי תקלות בזיכרונות</h3>
</div>
</div>

<div id="outline-container-org88bc2a1" class="outline-2">
<h2 id="org88bc2a1"><span class="section-number-2">8.</span> יחידות זכרון</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ido Merenstein</p>
<p class="date">Created: 2023-02-23 Thu 15:56</p>
</div>
</body>
</html>